"""
● 자연어란?
우리가 일상에서 사용하는 언어



● 자연어 처리란?
컴퓨터는 자연어를 직접적으로 이해할 수 었기 때문에
컴퓨터 분야에서 자연어 의미를 분석해 컴퓨터가 처리할 수 있도록 하는 일
Natural Language Processing (NLP)



● 효율적으로 자연어를 컴퓨터에 이해시키는 방법은?
여러 방법론이 존재하지만 가장 일반적인 방법론은:
1. 우선 어떤 문장을 일정한 의미가 있는 가장 작은 단어들로 나눈다.
2. 그 다음 나누어진 단어들을 통해 의미분석을 한다.

여기서 가장 기본이 되는 단어들을 토큰 이라고 한다

토큰의 단위는 토크나이징 방법에 따라 달라질 수 있지만
일반적으로 일정한 의미가 있는 가장 작은 정보단위로 결정된다.




● 토크나이징이란?
주어진 문장에서 토큰 단위로 정보를 나누는 작업

문장 형태의 데이터를 처리하기 위해
제일 처음 수행해야 하는 기본적인 작업이며,
주로 텍스트 전처리 과정에서 사용된다.

토크나이징을 어떻게 하느냐에 따라 성능 차이가 날 수 있다.


"""


